# Pandas

## Table of Contents:
- [Core Components](#core)
- [Series](#series)
- [Anatomy of a Series](#anatoser)
    - [Name](#seriesname)
    - [Data Types](#seriesdtype)
    - [Index](#seriesindex)
- [loc vs iloc](#lociloc)
- [Selecting multiple elements](#multelem)
- [Conditional Selecting](#condselec)
- [Apply to Series](#srapply)
- [Conditional Selecting with different Series](#cond2)
- [Data Frame](#dataframe)
- [Anatomy of a DataFrame](#anatodf)
    - [Index](#dfind)
    - [Columns](#dfcol)
    - [Values](#dfval)
    - [Data Types](#dfdtypes)
- [Accessing an element](#dfaccess)
- [loc vs iloc in DataFrames](#dfloc)
- [Creating New Column](#newcol)
- [Creating DataFrame from existing Series](#fromsr)
- [Joins](#joins)

### What are pandas?

Cute fluffy roly-poly little Oreo¬Æ bears. üêº

<img src=https://i.pinimg.com/originals/f1/3d/3a/f13d3ad553a358e40253b88bd3298d66.png width=200 align=left>

### Also...

One of the most important libraries in python for data!

Let's keep the [pandas documentation](https://pandas.pydata.org/docs/reference/index.html#api) handy, it will surely be useful!

In [320]:
# Importing it
import pandas as pd
import numpy as np

### What does `as` mean in python?

It is pretty common to see some libraries or modules imported using this keyword. It is useful for creating an `alias`. It is meant to create a shortcut for programmers and some libraries are so continuously used, that we will pretty much always see them with aliases.
```python
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
```
etc.. Can you imagine having to type `matplotlib.pyplot` everytime we use one of it's functions?
There is no official rule and you can use aliases for your own modules or any other library.

`Note:` If a given library is imported with an alias, we can only use it with given alias, not by the original name.
Check the output bellow and you'll see that only `pd` is currently present on the [Namespace](https://realpython.com/python-namespaces-scope/), not `pandas`.

In [321]:
[k for k in globals().keys() if k.startswith("p")]

['pd', 'pop']

# Core Components <a name=core></a>
## [Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html) <a name=series></a>
- One-dimensional array of values

In [322]:
sr = pd.Series([10,25,30,45,50])

In [323]:
sr

0    10
1    25
2    30
3    45
4    50
dtype: int64

In [324]:
type(sr)

pandas.core.series.Series

`Can we treat a pd.Series as a list?`

In [325]:
sr[2]

30

In [326]:
[v/2 for v in sr]

[5.0, 12.5, 15.0, 22.5, 25.0]

In [327]:
sum(sr)

160

Yes, pretty much. However, it does much more. Check the docs and we will se there are a `LOT` of methods specifically written for series. üòâ

In [328]:
print([att for att in dir(sr) if not att.startswith("_")])

['T', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'attrs', 'autocorr', 'axes', 'backfill', 'between', 'between_time', 'bfill', 'bool', 'clip', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'explode', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'floordiv', 'ge', 'get', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'interpolate', 'is_monotonic', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'iteritems', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lt', 'mad', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'sem', 'set_axis', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'std', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_markdown', 'to_numpy', 'to_period', 'to_pickle', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [329]:
## Sum using pd.Series method
sr.sum()

160

In [330]:
sr.min(),sr.max(),sr.mean()

(10, 50, 32.0)

### "Anatomy" of a series <a name=anatoser></a>

In [331]:
sr

0    10
1    25
2    30
3    45
4    50
dtype: int64

In [332]:
# Values
sr.values

array([10, 25, 30, 45, 50])

In [333]:
type(sr.values)

numpy.ndarray

In [334]:
# Index
sr.index

RangeIndex(start=0, stop=5, step=1)

In [335]:
# Data type
sr.dtype

dtype('int64')

In [336]:
type(sr[4])

numpy.int64

In [337]:
num_max = sum([2**n for n in range(64)])
num_max

18446744073709551615

In [338]:
ov = pd.Series([18446744073709551615])
ov

0    18446744073709551615
dtype: uint64

In [339]:
# Overflow
ov + 1

0    0
dtype: uint64

In [340]:
# Name
print(sr.name)

None

###### Name <a name=seriesname></a>

In [341]:
sr.name = "Numbers"

In [342]:
sr

0    10
1    25
2    30
3    45
4    50
Name: Numbers, dtype: int64

###### Dtype <a name=seriesdtype></a>

In [343]:
# Data types cannot be asigned
sr.dtype = str

AttributeError: can't set attribute

In [344]:
sr.apply(str)

0    10
1    25
2    30
3    45
4    50
Name: Numbers, dtype: object

Dtypes is calculated by pandas, not defined by us

In [345]:
sr[3] = "Forty-Four"
sr

0            10
1            25
2            30
3    Forty-Four
4            50
Name: Numbers, dtype: object

In [346]:
sr.apply(type)

0    <class 'int'>
1    <class 'int'>
2    <class 'int'>
3    <class 'str'>
4    <class 'int'>
Name: Numbers, dtype: object

When there are multiple data types among the values of a Series, dtype will be `object`

- We cannot sum the series because it has a string, but if we change everything that is not a number for np.nan, it will work.

In [347]:
sr.apply(lambda x: x if type(x) == int else np.nan).sum()

115.0

In [348]:
sr

0            10
1            25
2            30
3    Forty-Four
4            50
Name: Numbers, dtype: object

###### Index <a name=seriesindex></a>

In [349]:
sr

0            10
1            25
2            30
3    Forty-Four
4            50
Name: Numbers, dtype: object

In [350]:
sr.index = ["a","b","c","d","e"]

In [351]:
sr

a            10
b            25
c            30
d    Forty-Four
e            50
Name: Numbers, dtype: object

In [352]:
sr["d"]

'Forty-Four'

In [353]:
sr[3]

'Forty-Four'

## `loc` vs `iloc` <a name=lociloc></a>
- `loc` -> Locate (by index **name**)
- `iloc` -> Index Locate (by index **position** \[number\])

In [354]:
sr = pd.Series([6,3,78,2,4,0,4])

- `.sort_values()`

In [355]:
sr.sort_values(inplace=True)

Using the parameter `inplace=True`, we can change the object, the same as if we were to do:
```python
sr = sr.sort_values()
```

In [356]:
sr

5     0
3     2
1     3
4     4
6     4
0     6
2    78
dtype: int64

In [357]:
sr[0]

6

# Index **NAME** > Index Position

In [358]:
# 2 is the KEY of value 78
sr.loc[2]

78

In [359]:
# 2 is the POSITION of value 3
sr.iloc[2]

3

## Practical example with loc and iloc <a name=practloc></a>

In [360]:
grades = pd.Series(name="Grades",data=[8,3,4,np.nan,5.7,7,8.9,10])

In [361]:
grades

0     8.0
1     3.0
2     4.0
3     NaN
4     5.7
5     7.0
6     8.9
7    10.0
Name: Grades, dtype: float64

In [362]:
# Removing nulls
grades.dropna(inplace=True)

In [363]:
# Indexes are not reasigned
grades

0     8.0
1     3.0
2     4.0
4     5.7
5     7.0
6     8.9
7    10.0
Name: Grades, dtype: float64

In [364]:
# There is no index NAME 3...
grades[3]

KeyError: 3

In [365]:
# But there is an element at position 3
grades.iloc[3]

5.7

In [366]:
grades.sort_values(inplace=True, ascending=False)

In [367]:
grades

7    10.0
6     8.9
0     8.0
5     7.0
4     5.7
2     4.0
1     3.0
Name: Grades, dtype: float64

### Selecting multiple <a name=multelem></a>

In [368]:
# With a "range"
top3 = grades.iloc[:3]

In [369]:
top3

7    10.0
6     8.9
0     8.0
Name: Grades, dtype: float64

In [370]:
# With a list
grades[[1,2,4]]

1    3.0
2    4.0
4    5.7
Name: Grades, dtype: float64

In [371]:
# You must pass a LIST to loc. There should be two pairs of []
grades[1,2,4]

ValueError: key of type tuple not found and not a MultiIndex

In [372]:
sr.shape

(7,)

In [373]:
sr.index = [1,2,3,4,"a","b",("a","b")]

In [374]:
sr

1          0
2          2
3          3
4          4
a          4
b          6
(a, b)    78
dtype: int64

In [375]:
sr[["a","b"]]

a    4
b    6
dtype: int64

In [376]:
ind = ["a","b"]
sr[ind]

a    4
b    6
dtype: int64

In [377]:
sr["a","b"]

78

### Having Fun with Indexes!!! <a name=condselec></a>
- Some operators used with a series will result on a list of True and False.
- A list of True and False may be used as an index locator for Series

In [378]:
animals = pd.Series(name="animal_pop",
                    index=["gorilla","orca","panda","rhino","lynx"],
                    data=[1063,50_000,1864,27_000,900])

In [379]:
animals

gorilla     1063
orca       50000
panda       1864
rhino      27000
lynx         900
Name: animal_pop, dtype: int64

In [380]:
animals["panda"]

1864

In [381]:
animals + 5

gorilla     1068
orca       50005
panda       1869
rhino      27005
lynx         905
Name: animal_pop, dtype: int64

### Selecting a subset
#### Messy way

In [382]:
lst = []
ind = []
i = 0
for pop in animals:
    if pop < 2000:
        lst.append(pop)
        ind.append(animals.index[i])
    i+=1

In [383]:
lst, ind

([1063, 1864, 900], ['gorilla', 'panda', 'lynx'])

In [384]:
danger = pd.Series(index=ind, data=lst)

In [385]:
danger

gorilla    1063
panda      1864
lynx        900
dtype: int64

## Now, the proper way

In [386]:
animals < 2000

gorilla     True
orca       False
panda       True
rhino      False
lynx        True
Name: animal_pop, dtype: bool

In [387]:
# FROM animals LOCATE THE ELEMENTS WHERE value < 2000
danger = animals.loc[animals < 2000]
danger

gorilla    1063
panda      1864
lynx        900
Name: animal_pop, dtype: int64

In [388]:
# Any list or Series of Trues and Falses may be used as an index
animals[[True,False,False, True, True]]

gorilla     1063
rhino      27000
lynx         900
Name: animal_pop, dtype: int64

## .apply is the same as map() <a name=srapply></a>

In [389]:
animals.apply(lambda x: x%2 == 1)

gorilla     True
orca       False
panda      False
rhino      False
lynx       False
Name: animal_pop, dtype: bool

In [390]:
animals[animals.apply(lambda x: x%2 == 1)]

gorilla    1063
Name: animal_pop, dtype: int64

Any list of Trues and Falses is valid, as long it has the same length and/or index

In [391]:
less5char = list(map(lambda x: len(x) < 5,animals.index))
less5char

[False, True, False, False, True]

In [392]:
animals[less5char]

orca    50000
lynx      900
Name: animal_pop, dtype: int64

## Combining 2 Series with loc <a name=cond2></a>
# Index are KEY (pun intended)

In [393]:
hab = pd.Series(name="habitat",
                    index=["gorilla","orca","panda","rhino","lynx"],
                    data=["Africa","Ocean","Asia","Africa","Europe"])

In [394]:
hab == "Africa"

gorilla     True
orca       False
panda      False
rhino       True
lynx       False
Name: habitat, dtype: bool

In [395]:
hab[hab == "Africa"]

gorilla    Africa
rhino      Africa
Name: habitat, dtype: object

In [396]:
animals[hab == "Africa"]

gorilla     1063
rhino      27000
Name: animal_pop, dtype: int64

In [397]:
hab_sorted = hab.sort_values()
hab_sorted

gorilla    Africa
rhino      Africa
panda        Asia
lynx       Europe
orca        Ocean
Name: habitat, dtype: object

In [398]:
animals

gorilla     1063
orca       50000
panda       1864
rhino      27000
lynx         900
Name: animal_pop, dtype: int64

In [399]:
hab_sorted == "Africa"

gorilla     True
rhino       True
panda      False
lynx       False
orca       False
Name: habitat, dtype: bool

In [400]:
animals[hab_sorted == "Africa"]

gorilla     1063
rhino      27000
Name: animal_pop, dtype: int64

## What if there are different indexes on both series?

In [401]:
hab = pd.Series(name="habitat",
                    index=["gorilla","orca","panda","rhino","lynx", "giraffe", "shark"],
                    data=["Africa","Ocean","Asia","Africa","Europe", "Africa", "Ocean"])

It still works, even though there are more indexes in hab than in animals

In [402]:
animals[hab == "Africa"]

gorilla     1063
rhino      27000
Name: animal_pop, dtype: int64

In [403]:
hab == "Africa"

gorilla     True
orca       False
panda      False
rhino       True
lynx       False
giraffe     True
shark      False
Name: habitat, dtype: bool

In [404]:
animals

gorilla     1063
orca       50000
panda       1864
rhino      27000
lynx         900
Name: animal_pop, dtype: int64

In [405]:
# The reverse doesn't work because there are indexes in hab missing in animals
hab[animals < 2000]

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

### When passing a Series of True and False to sr.loc, all elements of sr must be present in the Series
- Make sure all the index on "BASE" Series are present on the other one, but the reverse doesn't have to be true
- More on that on merging... ;)

In [406]:
set(animals.index).issubset(set(hab.index))

True

In [407]:
set(hab.index).issubset(set(animals.index))

False

# [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html) <a name=dataframe></a>
- Two-dimensional matrix of values organized in rows and columns.

#### Columns and Rows of a DataFrame are pd.Series
- Everything we saw previously also applies to DataFrames

In [408]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

## "Anatomy" of a DataFrame <a name=anatodf></a>
#### Index <a name=dfind></a>

In [409]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [410]:
df.index = ["one","two","three"]

In [411]:
df

       0  1  2
one    1  2  3
two    4  5  6
three  7  8  9

#### Columns <a name=dfcol></a>

In [412]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [413]:
df.columns = ["A","B","C"]

In [414]:
df

       A  B  C
one    1  2  3
two    4  5  6
three  7  8  9

#### Values <a name=dfval></a>

In [415]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

#### Data Types <a name=dfdtypes></a>
- This differs a bit. It will return a dtype for each column

In [416]:
df.dtypes

A    int64
B    int64
C    int64
dtype: object

### Accessing elements <a name=dfaccess></a>

In [417]:
# A column, by it's name
df["A"]

one      1
two      4
three    7
Name: A, dtype: int64

In [418]:
# or... (Doesn't apply for column names with spaces and some special characters)
df.A

one      1
two      4
three    7
Name: A, dtype: int64

### Using loc and iloc with DataFrames. <a name=dfloc></a>
- It is the same as with series, but remember we are using 2 dimensions now. 
- We must always use `[row, col]`

In [419]:
df.loc["one","A"]

1

In [420]:
# Using only one element will mean a ROW
df.loc["one"]

A    1
B    2
C    3
Name: one, dtype: int64

In [421]:
# We can use : for ranges or "Everything"
df.loc[:,"A"]

one      1
two      4
three    7
Name: A, dtype: int64

In [422]:
# The same for iloc, but with index POSITION
df.iloc[0]

A    1
B    2
C    3
Name: one, dtype: int64

In [423]:
df.iloc[:2,0]

one    1
two    4
Name: A, dtype: int64

In [424]:
df.iloc[0,0]

1

### Asigning a new column <a name=newcol></a>
- Just name it. üòú

In [425]:
df["new"] = ["a","b","c"]
df

       A  B  C new
one    1  2  3   a
two    4  5  6   b
three  7  8  9   c

### Creating a DataFrame from existing Series <a name=fromsr></a>

In [426]:
zoo = pd.DataFrame()

In [427]:
zoo["Habitat"] = hab
zoo["Pop"] = animals

In [428]:
zoo

        Habitat      Pop
gorilla  Africa   1063.0
orca      Ocean  50000.0
panda      Asia   1864.0
rhino    Africa  27000.0
lynx     Europe    900.0
giraffe  Africa      NaN
shark     Ocean      NaN

In [429]:
type(zoo["Pop"])

pandas.core.series.Series

In [430]:
zoo.loc["gorilla"]

Habitat    Africa
Pop          1063
Name: gorilla, dtype: object

In [431]:
type(zoo.loc["gorilla"])

pandas.core.series.Series

In [432]:
zoo["Habitat"] = zoo["Habitat"].apply(lambda x: x.lower())

In [433]:
zoo

        Habitat      Pop
gorilla  africa   1063.0
orca      ocean  50000.0
panda      asia   1864.0
rhino    africa  27000.0
lynx     europe    900.0
giraffe  africa      NaN
shark     ocean      NaN

## Joins <a name=joins></a>
- left
- right
- inner
- outer

In [434]:
animals = animals.to_frame()

In [435]:
animals

         animal_pop
gorilla        1063
orca          50000
panda          1864
rhino         27000
lynx            900

In [436]:
### Spaces to make it clear that left and right refer to 
### the elements of the left or right of .join
animals .join(  hab  , how="left")

         animal_pop habitat
gorilla        1063  Africa
orca          50000   Ocean
panda          1864    Asia
rhino         27000  Africa
lynx            900  Europe

In [437]:
animals .join(  hab  , how="right")

         animal_pop habitat
gorilla      1063.0  Africa
orca        50000.0   Ocean
panda        1864.0    Asia
rhino       27000.0  Africa
lynx          900.0  Europe
giraffe         NaN  Africa
shark           NaN   Ocean

In [438]:
# In this case, inner results the same as left.
# This is not true for all cases
animals .join(  hab  , how="inner")

         animal_pop habitat
gorilla        1063  Africa
orca          50000   Ocean
panda          1864    Asia
rhino         27000  Africa
lynx            900  Europe

In [439]:
# In this case, outer results the same as right.
# This is not true for all cases
animals .join(  hab  , how="outer")

         animal_pop habitat
giraffe         NaN  Africa
gorilla      1063.0  Africa
lynx          900.0  Europe
orca        50000.0   Ocean
panda        1864.0    Asia
rhino       27000.0  Africa
shark           NaN   Ocean

## Different joins

In [440]:
df1 = pd.DataFrame(data=[1,2,3,4], index=list("ABCD"), columns=["col1"])
df2 = pd.DataFrame(data=[5,6,7,8], index=list("CDEF"), columns=["col2"])

In [441]:
df1

   col1
A     1
B     2
C     3
D     4

In [442]:
df2

   col2
C     5
D     6
E     7
F     8

#### Left

In [443]:
df1.join(df2, how="left")

   col1  col2
A     1   NaN
B     2   NaN
C     3   5.0
D     4   6.0

#### Right

In [444]:
df1.join(df2, how="right")

   col1  col2
C   3.0     5
D   4.0     6
E   NaN     7
F   NaN     8

#### Inner

In [445]:
df1.join(df2, how="inner")

   col1  col2
C     3     5
D     4     6

#### Outer

In [446]:
df3 = df1.join(df2, how="outer")
df3

   col1  col2
A   1.0   NaN
B   2.0   NaN
C   3.0   5.0
D   4.0   6.0
E   NaN   7.0
F   NaN   8.0

Operating on columns is the same as operating on Series

In [447]:
df1["col1"].mean()

2.5

In [448]:
df1.col1.mean()

2.5

In [449]:
df3[df3["col1"]<3]

   col1  col2
A   1.0   NaN
B   2.0   NaN

##### Next...
- Join, Merge, Concat
- Iterating over DataFrames (iterrows)
- Apply over 2 dimensions (axis)
- Explode
- Transpose, Pivot, Melt
- Advanced Data Cleaning

![](https://miro.medium.com/max/284/1*-gCi3kMULkOY0xIkl8Wdwg.png)